InformationRegisters/ЛБ_ПравилаПеремещенияОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПравилаПеремещенияОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидПеремещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеремещенияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Откуда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДвиженияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДвиженияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСкладаОткуда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСкладаКуда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ДвиженияОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ДвиженияОбъектовЗалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ломбард</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЛБ_ПравилаПеремещенияОбъектовЗалога/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидСкладаОткудаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВидСкладаНачалоВыбора(Элемент, "Откуда");	                                                
КонецПроцедуры

&НаКлиенте
Процедура ВидСкладаКудаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВидСкладаНачалоВыбора(Элемент, "Куда");	
КонецПроцедуры

&НаКлиенте
Процедура ВидСкладаНачалоВыбора(Элемент, Направление)
	ЭтоЦО = Ложь;
	Если Направление = "Откуда" И Запись.Откуда = ПредопределенноеЗначение("Перечисление.ЛБ_ДвиженияОбъектовЗалога.ЦО") Тогда
		ЭтоЦО = Истина;
	ИначеЕсли Направление = "Куда" И Запись.Куда = ПредопределенноеЗначение("Перечисление.ЛБ_ДвиженияОбъектовЗалога.ЦО") Тогда
		ЭтоЦО = Истина;
	КонецЕсли;	       
	
	Если ЭтоЦО Тогда
	    СписокВыбора = ПолучитьСписокВыбораЦО();
	Иначе	
		СписокВыбора = Новый СписокЗначений; 

		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Залоги")); 
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Витрина"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ОтходыДМ"));
	КонецЕсли;
	
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элемент); 

	Если ВыбранноеЗначение <> Неопределено Тогда
		Если Направление = "Откуда" Тогда
	        Запись.ВидСкладаОткуда = ВыбранноеЗначение.Значение; 
		Иначе 
			Запись.ВидСкладаКуда = ВыбранноеЗначение.Значение;
		КонецЕсли;	
	КонецЕсли;        	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораЦО() 
	СписокВыбора = Новый СписокЗначений;
	Для каждого ЗначениеПеречисления Из Перечисления.ЛБ_ВидыСкладов Цикл 
		Если ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.Залоги Тогда
			Продолжить;  
		ИначеЕсли ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.Витрина Тогда
			Продолжить;	   
		ИначеЕсли ЗначениеПеречисления = Перечисления.ЛБ_ВидыСкладов.ОтходыДМ Тогда
			Продолжить;		
		Иначе	
		    СписокВыбора.Добавить(ЗначениеПеречисления);
		КонецЕсли;	
	КонецЦикла;	
	Возврат СписокВыбора;
КонецФункции	

&НаКлиенте
Процедура ОткудаПриИзменении(Элемент)
	Запись.ВидСкладаОткуда = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура КудаПриИзменении(Элемент)
	Запись.ВидСкладаКуда = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ПустаяСсылка");
КонецПроцедуры
